# Задание 1:
# Запросить у пользователя 5 чисел и записать их в список

numbers = input('Enter numbers here: ').split(',')
print(numbers)
